package utils

import (
	"time"
)

// ZeroTime инкапсулирует эталонное нулевое значение даты и времени, жестко привязанное к таймзоне UTC.
//
// 💡 Инженерный нюанс:
// В отличие от стандартного инициализатора time.Time{}, который неявно завязан на локальное время сервера (Local),
// данный синглтон гарантирует консистентность дефолтных временных меток в распределенных cloud-native кластерах,
// полностью исключая коллизии смещений при валидации данных, сериализации в JSON и сохранении в PostgreSQL.
var ZeroTime = time.Date(1, 1, 1, 0, 0, 0, 0, time.UTC)
