package test

// TestData инкапсулирует в себе плоскую структуру данных для модульного (Unit) тестирования.
// Применяется для верификации базовых сценариев валидации, фильтрации и маппинга доменных моделей.
//
//goland:noinspection GoNameStartsWithPackageName
type TestData struct {
	ID     int  `json:"id"`     // Уникальный целочисленный идентификатор тестовой записи
	Active bool `json:"active"` // Атомарный флаг логического статуса активности сущности
}

// BenchData инкапсулирует в себе легковесную структуру данных для нагрузочного (Benchmark) тестирования.
// Оптимизирована для проведения сквозных замеров производительности I/O подсистем, кэшей и сериализаторов.
type BenchData struct {
	ID    int    `json:"id"`    // Уникальный целочисленный идентификатор бенчмарк-записи
	Value string `json:"value"` // Строковое текстовое наполнение (Payload) для оценки аллокаций памяти в куче
}
