package domain

import (
	"context"
	"time"
)

// TailRepository определяет строго типизированный обобщенный интерфейс доменного уровня
// для очистки устаревших исторических хвостов и отработанных логов журнала Outbox (паттерн Tail Cutter).
//
// Интерфейс вынесен в публичный контур пакета 'pkg/', что позволяет использовать его как отчуждаемый
// платформенный SDK-компонент, импортируемый другими микросервисами экосистемы для обслуживания их локальных таблиц Outbox.
type TailRepository[ID comparable] interface {
	// GetTail извлекает из СУБД список идентификаторов записей, чье время жизни или обновления меньше временной метки tailDate.
	// Используется фоновым Use Case для предварительного отбора пачки ключей, подлежащих плановой очистке.
	GetTail(ctx context.Context, tailDate time.Time) ([]ID, error)

	// Delete осуществляет точечное физическое удаление одной записи из хранилища Outbox по её уникальному первичному ключу.
	// Метод оптимизирован под попоточную обработку в горутинах и гарантирует константную скорость выполнения O(1) в СУБД.
	Delete(ctx context.Context, id ID) error
}
