package broker

import (
	"context"
)

// Sender предназначен для работы по схеме 1 к 1.
// Он жестко завязан на одну конкретную очередь/топик, переданную в конструктор.
//
// Выступает абстрактным контрактом продюсера (Publisher) для отправки бизнес-событий фреймворка.
// Изолирует прикладную логику от специфики батчинга и сетевых подтверждений брокера (Kafka, AMQP).
type Sender interface {
	// Publish выполняет атомарную публикацию сообщения msg в целевой топик/очередь в рамках контекста ctx.
	Publish(ctx context.Context, msg Message) error

	// Close осуществляет плавное закрытие продюсера с гарантированным сбросом (flush) локальных буферов в сеть.
	Close(ctx context.Context) error

	// GetTargetName возвращает строковое имя топика или очереди, за которой жестко закреплен текущий инстанс Sender.
	GetTargetName() string
}
