package worker

// Pool описывает универсальный, строго типизированный (Generic) контракт пула конкурентных воркеров (Worker Pool Pattern).
//
// Объединяет под своей эгидой базовый жизненный цикл потоков (CommonWorker) и методы распределения задач.
// Инкапсулирует в себе стратегии управления обратным давлением (Backpressure), позволяя Highload-системам
// гибко балансировать между блокирующим ожиданием и неблокирующим сбросом задач при пиковых перегрузках.
type Pool[D any] interface {
	CommonWorker // Наследует базовые методы запуска (Start), мягкого гашения (Stop) и хелсчеков рантайма

	// Push выполняет атомарную блокирующую вставку задачи в очередь пула воркеров.
	// Если буфер емкости исчерпан, текущая горутина блокируется, реализуя стратегию защиты памяти (Backpressure).
	Push(data D)

	// TryPush пытается выполнить мгновенную неблокирующую вставку задачи в пул воркеров.
	// Возвращает true, если задача успешно встала в буфер, и false, если пул перегружен, предотвращая зависание потока.
	TryPush(data D) bool

	// Len возвращает текущее количество задач, удерживаемых в буфере очереди и ожидающих обработки.
	Len() int

	// Capacity возвращает верхний жесткий лимит (вместимость) буфера внутренней очереди пула воркеров.
	Capacity() int
}
